//
//  Data.swift
//  korusell
//
//  Created by Sergey Lee on 2023/05/09.
//

import Foundation

let listOfMembers: [Member] = [
    Member(name: "Евгений", surname: "Ким", nickname: "eugene88", tags: ["мероприятия", "ведущий", "тамада", "праздники", "свадьбы", "асянди", "хангаби", "успешный успех"]),
    Member(name: "Сергей", surname: "Ли", nickname: "k0jihero", tags: ["IT", "программирование", "музыкант", "ios", "мобильные", "приложения"]),
    Member(name: "Антон", surname: "Емельянов", nickname: "antonmaker", tags: ["IT", "программирование", "музыкант", "web", "сайты"]),
    Member(name: "Андрей", surname: "Ким", nickname: "andrew1"),
    Member(name: "Владимир", surname: "Мун", nickname: "vladi87"),
    Member(name: "Вероника", surname: "Мун", nickname: "veronika_mun"),
    Member(name: "David", surname: "Beckham", nickname: "david_b")
]

let fakeUser = Member(name: "Сергей", surname: "Ли", nickname: "k0jihero")


let listOfCategories: [Category] = [
    Category(name: "Дизайн", image: "design", tags: ["услуги", "дизайн", "design", "UI", "UX"]),
    Category(name: "IT", image: "IT", tags: ["услуги", "IT", "программирование", "приложения", "сайт", "web"]),
    Category(name: "Фото, Видео", image: "photo", tags: ["услуги", "photo", "video", "видео", "фото", "съемка", "праздник", "мероприятия"]),
    Category(name: "Маркетинг", image: "marketing", tags: ["услуги", "маркетинг", "продажи", "продвижение", "СММ", "SMM", "marketing"]),
    Category(name: "Переводы", image: "translate", tags: ["услуги", "translate", "переводы", "переводчик", "корейский", "английский"]),
    Category(name: "Здоровье, Красота", image: "health", tags: ["услуги", "здоровье", "красота", "стоматология", "косметика", "тату", "парикмахер", "визажист", "маникюр", "педикюр", "зубной", "ресницы", "пластика", "гинекология", "услуги1", "здоровье1", "красота1", "стоматология1", "косметика1", "тату1", "парикмахер1", "визажист1", "маникюр1", "педикюр1", "зубной1", "ресницы1", "пластика1", "гинекология1"]),
    Category(name: "Транспорт", image: "transport", tags: ["transport", "транспорт", "перевозки", "груз", "автомобиль", "транспорт", "купля", "продажа", "экспорт", "СТО", "ремонт", "тюнинг"]),
    Category(name: "Образование", image: "education", tags: ["образование", "смена", "виза", "корейский", "язык", "дизайн", "программирование", "курсы"]),
    Category(name: "Ремонт", image: "repair", tags: ["услуги", "ремонт", "электроника", "техника", "дом", "квартиры", "помещение", "сантехника", "электрика"]),
    Category(name: "Мероприятия", image: "event", tags: ["услуги", "праздник", "мероприятия", "ведущий", "тамада", "вокалист", "певец"])
]

/*
 Members categories:
    IT/Дизайн
    Фото/Видео
    Маркетинг
    Переводы
    Ремонт
    Здоровье/Красота
    Транспорт
    Образование
    Трудоустройство
    Мероприятия/Подарки
    Страхование/Финансы
 
 
 
    Ремонт
        Электроника, Дом
    ? Телефоны
        Купля, Продажа, Связь, Аксессуары
    Образование
        Курсы, школа, смена визы,
    Мероприятия, Фото/Видео
        Ведущий, Певец, Фото, Видео, Цветы?
    Колеса
        Купля, Продажа, Экспорт, Перевозки, СТО, Тюнинг
    Здоровье/Красота
        Стоматология, Косметика, Тату, Салон красоты, Парикмахер, Маникюр, Педикюр, Ресницы, Пластика, Гинекология
    Страхование/Финансы
        Страхование, Кредитные карты,
    Туризм/Почта
        Авиакасса, Почта, Туризм
    Трудоустройство
    Перевод
 */
